tutorial/programmer-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-07-03 Fri 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial #2: Introducing Commands</title>
<meta name="author" content="Connor Fynn Redfern" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../doc-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial #2: Introducing Commands</h1>
<p>
<a href="programmer-1.html">Prev</a>  <a href="../index.html">Up</a>  <a href="programmer-3.html">Next</a>
</p>
<div id="outline-container-org43b7cad" class="outline-2">
<h2 id="org43b7cad">Current Directory</h2>
<div class="outline-text-2" id="text-org43b7cad">
<p>
Here, we will focus on adding some simple features to our shell. First up, it is
common for a shell to print the name of the current directory before the prompt.
In Relic, we can access this string with <code>get-current-directory</code>, which will
return a (freshly allocated) string with the name of the current directory. As
with <code>read-line</code>, we will need to free this memory later. Let's replace our call
to <code>write-string</code> with a <code>prompt</code> function which will print the prompt for the
user.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> prompt <span style="color: #9d81ba;">proc</span> [] <span style="color: #9d81ba;">seq</span>
  [<span style="color: #9d81ba;">let</span> cwd (platform<span style="color: #7CF083;">.filesystem.get-current-directory</span>)]
  (write-line cwd)
  (data<span style="color: #7CF083;">.string.delete</span> cwd)
  (write-string <span style="color: #f5c791;">"&gt; "</span>))
</pre>
</div>

<p>
Inside our main function, we then can rewrite the loop.
</p>
<div class="org-src-container">
<pre class="src src-relic">  (<span style="color: #9d81ba;">loop</span> 
    (prompt)
    [<span style="color: #9d81ba;">while</span> (iter (read-line))])
</pre>
</div>

<p>
Before moving on, now is a good time to start thinking about <b>imports</b> referring
to the <code>get-current-directory</code> function by the fill import path is a bit
unwieldy, so we can <i>import</i> the filesystem module, meaning that we can simply
refer to <code>filesystem.get-current-directory</code>. 
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">import</span> platform<span style="color: #7CF083;">.filesystem</span>)

<span style="color: #454459;">;;</span><span style="color: #454459;">....
</span> 
(<span style="color: #9d81ba;">def</span> prompt <span style="color: #9d81ba;">proc</span> [] <span style="color: #9d81ba;">seq</span>
  [<span style="color: #9d81ba;">let</span> cwd (filesystem<span style="color: #7CF083;">.get-current-directory</span>)]
  (write-line cwd)
  (data<span style="color: #7CF083;">.string.delete</span> cwd)
  (write-string <span style="color: #f5c791;">"&gt; "</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga94e5a8" class="outline-2">
<h2 id="orga94e5a8">Commands</h2>
<div class="outline-text-2" id="text-orga94e5a8">
<p>
Of cource, once we display the current directory, we will want a way to change it.
This can be done in relic using <code>set-current-directory</code>, but before we can do
<i>that</i>, we first need to provide our shell with the ability to recognize
different commands, beyond just 'exit'.
</p>

<p>
The natural next step then is to separate our input string on spaces, so let's
start by importing some functions that will be useful later.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">import</span>
 platform<span style="color: #7CF083;">.filesystem</span>
 platform<span style="color: #7CF083;">.memory</span>

 (data<span style="color: #7CF083;">.pointer</span> <span style="color: #7CF083;">:only</span> (get set local))
 (data<span style="color: #7CF083;">.list</span> <span style="color: #7CF083;">:only</span> (mk-list push elt))
 (data<span style="color: #7CF083;">.string</span> <span style="color: #7CF083;">:only</span> (subview nth-byte)))
</pre>
</div>

<p>
Our algorithm will run as follows:
</p>
<ul class="org-ul">
<li>Initialize the compoents (list of strings we want to return) to an empty list</li>
<li>Initialize the start of the <b>current word</b> to the start of the string</li>
</ul>

<p>
Then, we will loop over each character in the string, and:
</p>
<ul class="org-ul">
<li>If current character is a space, do to things:
<ul class="org-ul">
<li>Add a new word starting at our most recent word start, and ending just
before the current character.</li>
<li>Reset the start of the current word to the character after the current one</li>
</ul></li>
</ul>

<p>
Note that the last character may NOT be a space, so once our loop finishes, we
will need to act as if there is an extra character that <i>is</i> a space at the end
of the loop, to ensure the last word gets pushed on.
</p>

<p>
This algorithm is not perfect, and handles, e.g. double spaces less than
ideally, however, it is nice and simple, and should be more than enough for our
purposes.
</p>

<p>
We will start with our initialization. In Relic, the only way to get mutable
values by mutating memory explicitly, i.e. via pointers. We can use the <code>local</code>
function that we imported from the <code>pointer</code> module to create a pointer using
local (i.e. on-stack) memory. Note that you should <b>never</b> return a local
pointer from a procedure, as local (stack) memory is invalid once the procedure
returns.
</p>

<p>
We can initialize <code>start</code> with 0, and we want to initialize our list with 0
elements, but with space reserved for 8. 8 has been chosen as it will be enough
for most cases without being excessive, as lists will automatically grow if we
exceed their capacity.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> split-on <span style="color: #9d81ba;">proc</span> [str delimiter] <span style="color: #9d81ba;">seq</span>
  [<span style="color: #9d81ba;">let</span>! start (local <span style="color: #0D9C94;">0</span>)]
  [<span style="color: #9d81ba;">let</span>! components (local (list<span style="color: #7CF083;">.mk-list</span> <span style="color: #0D9C94;">0</span> <span style="color: #0D9C94;">8</span>))]

  <span style="color: #454459;">;; </span><span style="color: #454459;">Rest of the function goes here...
</span>  )
</pre>
</div>

<p>
The body of the loop is relatively easy to fill out, and we will make use of a
new piece of syntax and some new functions. The <code>when</code> conditional is like if,
but has no <code>:false</code> branch, as it is assumed implicitly return the value
<code>:unit</code>. Additionally, like <code>proc</code> and <code>def</code>, it performs auto parenthesization
after the condition.
</p>

<p>
Our new functions are <code>push</code> which will add a value to the end of our list, and
<code>subview</code>, which is like <code>substring</code>, but does not allocate any memory, it
simply provides a substring which views the original memory. This will make
cleanup easier later. The arguments to <code>subview</code> are the start and end position
of the substing, together with the original string we want to take the substring
of.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> split-on <span style="color: #9d81ba;">proc</span> [str delimiter] <span style="color: #9d81ba;">seq</span>
  [<span style="color: #9d81ba;">let</span>! start (local <span style="color: #0D9C94;">0</span>)]
  [<span style="color: #9d81ba;">let</span>! components (local (list<span style="color: #7CF083;">.mk-list</span> <span style="color: #0D9C94;">0</span> <span style="color: #0D9C94;">8</span>))]

  (<span style="color: #9d81ba;">loop</span> [<span style="color: #9d81ba;">for</span> i <span style="color: #9d81ba;">from</span> <span style="color: #0D9C94;">0</span> <span style="color: #9d81ba;">below</span> str<span style="color: #7CF083;">.memsize</span>]
    (when (= (nth-byte i str) delimiter) <span style="color: #9d81ba;">seq</span>

      <span style="color: #454459;">;; </span><span style="color: #454459;">Push the subcommant 
</span>      (push (subview (get start) i str) components)
      <span style="color: #454459;">;; </span><span style="color: #454459;">Set the start of the next womd to the character after the current one
</span>      (set start (+ i <span style="color: #0D9C94;">1</span>))))
  <span style="color: #454459;">;; </span><span style="color: #454459;">Rest of the function goes here...
</span>  )
</pre>
</div>

<p>
To finish the function, we will want to do the final subview push, to treat the
character <i>after</i> the last character as a space, then we will want to return the
value in the components pointer, which we can do with the <code>get</code> function.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> split-on <span style="color: #9d81ba;">proc</span> [str delimiter] <span style="color: #9d81ba;">seq</span>
  [<span style="color: #9d81ba;">let</span>! start (local <span style="color: #0D9C94;">0</span>)]
  [<span style="color: #9d81ba;">let</span>! components (local (list<span style="color: #7CF083;">.mk-list</span> <span style="color: #0D9C94;">0</span> <span style="color: #0D9C94;">8</span>))]

  (<span style="color: #9d81ba;">loop</span> [<span style="color: #9d81ba;">for</span> i <span style="color: #9d81ba;">from</span> <span style="color: #0D9C94;">0</span> <span style="color: #9d81ba;">below</span> str<span style="color: #7CF083;">.memsize</span>]
    (when (= (nth-byte i str) delimiter) <span style="color: #9d81ba;">seq</span>

      <span style="color: #454459;">;; </span><span style="color: #454459;">Push the subcommant 
</span>      (push (subview (get start) i str) components)
      <span style="color: #454459;">;; </span><span style="color: #454459;">Set the start of the next word to the character after the current one
</span>      (set start (+ i <span style="color: #0D9C94;">1</span>))))

  (push (subview (get start) str<span style="color: #7CF083;">.memsize</span> str) components)
  (get components))
</pre>
</div>

<p>
Now that we have our <code>split-on</code> function, we can re-write our <code>iter</code> function,
by getting the commands from the input line, then printing out each, which will
be a useful diagnostic to see if our procedure works correctly. To write a
character literal in Relic, we use #&lt;char&gt;, so <code>#a</code> is the character literal for
a. Note that in Relic, there is no difference between a character and a
function, so <code>#a</code> is the same as the number literal <code>97</code>. For some 'special'
characters, we refer to them by name, so space is <code>#space</code>. 
</p>

<p>
Once we are done with them, we can free the memory associated with the
underlying list with <code>memory.free</code>.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> iter <span style="color: #9d81ba;">proc</span> [str] <span style="color: #9d81ba;">seq</span>
  [<span style="color: #9d81ba;">let</span>! commands (split-on str #space)]

  (<span style="color: #9d81ba;">loop</span> [<span style="color: #9d81ba;">for</span> i <span style="color: #9d81ba;">from</span> <span style="color: #0D9C94;">0</span> <span style="color: #9d81ba;">below</span> commands<span style="color: #7CF083;">.len</span>]
    (write-line (elt i commands)))

  [<span style="color: #9d81ba;">let</span>! should-exit (<span style="color: #9d81ba;">if</span> (= str <span style="color: #f5c791;">"exit"</span>) <span style="color: #7CF083;">:false</span> <span style="color: #7CF083;">:true</span>)]
  (memory<span style="color: #7CF083;">.free</span> commands<span style="color: #7CF083;">.data</span>)
  (string<span style="color: #7CF083;">.delete</span> str)
  should-exit)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf51969e" class="outline-2">
<h2 id="orgf51969e">Advanced Control Flow</h2>
<div class="outline-text-2" id="text-orgf51969e">
<p>
Now that we have the command components, we will want to implement some
commands. We wil start with <code>cd</code> to set the current working directory, as
promised earlier, and <code>echo</code>, as it is simple. We will start with <code>echo</code> and
function to print errors if we receive a command that isn't recognized:
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> unrecognized <span style="color: #9d81ba;">proc</span> [cmd] <span style="color: #9d81ba;">seq</span>
  (write-string <span style="color: #f5c791;">"Unrecognized command: "</span>)
  (write-line cmd))

(<span style="color: #9d81ba;">def</span> echo <span style="color: #9d81ba;">proc</span> [args] <span style="color: #9d81ba;">seq</span>
  (<span style="color: #9d81ba;">loop</span> [<span style="color: #9d81ba;">for</span> i <span style="color: #9d81ba;">from</span> <span style="color: #0D9C94;">1</span> <span style="color: #9d81ba;">below</span> args<span style="color: #7CF083;">.len</span>]
    (write-string (elt i args))
    (write-string <span style="color: #f5c791;">" "</span>))
  (write-string <span style="color: #f5c791;">"\n"</span>))
</pre>
</div>

<p>
Next, we will cover the <code>cd</code> command, and use a new error handling strategy
making use of the <code>labels</code> term former. <code>labels</code> allows for code somewhat
similar to using <code>goto</code> in C, but with several differences.
</p>

<p>
The general layout of a <code>labels</code> form is as follows:
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">labels</span>
  &lt;starting-expression&gt;
  [label-1 [params<span style="color: #7CF083;">...</span>] &lt;body&gt;]
  [label-2 [params<span style="color: #7CF083;">...</span>] &lt;body&gt;]
  <span style="color: #7CF083;">...</span>)
</pre>
</div>

<p>
The way a <code>labels</code> statement works is that, whenever you are evaluating in
either the <i>starting-expression</i> or one of the label <i>bodies</i>, you can invoke
<code>(go-to label args...)</code> to jump execution to that label, with the label's
<i>params</i> substituted for the go-to's <i>args</i>. As a simple example, we can set up
a very basic loop that will print the numbers 1 to 10, shown below.
</p>

<p>
We have only two labels, <code>loop-continue</code>, which performs one iteration of the
loop, and <code>loop-exit</code>, which is how we stop the loop. The starting expression is
very simple and just kicks off the loop. Feel free to copy-paste this example
into a <code>repl</code>, or a <b>.rl</b> file and play around with running different variations.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">labels</span>
  (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">loop-continue</span> <span style="color: #0D9C94;">0</span>)

  [loop-continue [i] <span style="color: #9d81ba;">seq</span> 
    (write-string <span style="color: #f5c791;">"i: "</span>)
    (write-line (to-string i))

    (<span style="color: #9d81ba;">if</span> (u64<span style="color: #7CF083;">.</span>&lt; i <span style="color: #0D9C94;">10</span>)
        (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">loop-continue</span> (+ i <span style="color: #0D9C94;">1</span>))
        (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">loop-exit</span>))]

  [loop-exit (write-line <span style="color: #f5c791;">"done"</span>)])
</pre>
</div>

<p>
For our <code>cd</code> procedure, we will use <code>labels</code> to help in our error handling. We
have only one label: the <code>early-exit</code> label, which lets us quit the proc and
print an error message if something goes wrong. Otherwise, our <i>starting
expression</i> is actually most of the function, and represents the 'happy' (error
free) path for our code. At the moment, we will leave handling any errors raisd
by <code>set-current-directory</code> for later.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> cd <span style="color: #9d81ba;">proc</span> [args] <span style="color: #9d81ba;">labels</span>
  (<span style="color: #9d81ba;">seq</span>
    (when (u64<span style="color: #7CF083;">.</span>&lt; args<span style="color: #7CF083;">.len</span> <span style="color: #0D9C94;">1</span>)
      (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">early-exit</span> <span style="color: #f5c791;">"error: cd requires an argument; none was provided"</span>))
    (when (u64<span style="color: #7CF083;">.</span>&gt; args<span style="color: #7CF083;">.len</span> <span style="color: #0D9C94;">2</span>)
      (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">early-exit</span> <span style="color: #f5c791;">"error: cd requires exactly one argument; too many were provided"</span>))

    (write-string <span style="color: #f5c791;">"changing dir to: "</span>)
    (write-line (elt <span style="color: #0D9C94;">1</span> args))
    (filesystem<span style="color: #7CF083;">.set-current-directory</span> (elt <span style="color: #0D9C94;">1</span> args)))

  [early-exit [reason]
   (write-line reason)])
</pre>
</div>

<p>
Now that we have our 3 commands, we can re-write the <code>iter</code> proc once again. At
the moment, the simplest implementation is just to compare the command againts
all known command strings, i.e. "exit", "cd" and "echo". Normally, you would do
this with an if/else-if chain. However, the structure of Relic <code>if</code> would make
this unnecessarily painful to write, i.e.
<code>(if &lt;cond&gt; &lt;case1&gt; (if &lt;cond2&gt; &lt;case2&gt; ...))</code>, we would stack up a number of
closing parentheses equal to the number of if cases. Yikes! Instead, Relic has
<code>cond</code>, which lets you write a set of <code>[condition body]</code> pairs, and it will
match on the first condition that returns true. A quirk all terms in Relic
needing to evaluate to a value is that <code>cond</code> must guarantee that <i>at least</i> one
of the branches matches. As such, the last condition in a <code>cond</code> must always be
the literal <code>:true</code>, and you will get an error otherwise.
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> iter <span style="color: #9d81ba;">proc</span> [str] <span style="color: #9d81ba;">seq</span>
  [<span style="color: #9d81ba;">let</span>! should-continue local <span style="color: #7CF083;">:true</span>]
  [<span style="color: #9d81ba;">let</span>! commands (split-on str #space)]
  [<span style="color: #9d81ba;">let</span>! command-name (elt <span style="color: #0D9C94;">0</span> commands)]

  (<span style="color: #9d81ba;">cond</span>
   [(= <span style="color: #f5c791;">"exit"</span> command-name) (set should-continue <span style="color: #7CF083;">:false</span>)]
   [(= <span style="color: #f5c791;">"cd"</span> command-name) (cd commands)]
   [(= <span style="color: #f5c791;">"echo"</span> command-name) (echo commands)]
   [<span style="color: #7CF083;">:true</span> (unrecognized command-name)])

  (string<span style="color: #7CF083;">.delete</span> str)
  (memory<span style="color: #7CF083;">.free</span> commands<span style="color: #7CF083;">.data</span>)
  (get should-continue))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Connor Fynn Redfern</p>
<p class="date">Created: 2026-07-03 Fri 22:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
